// Тема: Сравнение методов вычисления числа единиц в двоичном представлении числа

// TODO:
// Методично описать каждый подход к вычислению числа единиц в двоичном представлении числа
// Измерить быстродействие по времени
// Построить график зависимости времени работы от числа бит в числе для всех алгоритмов
// - алгоритм с делением
// - алгоритм с побитовыми операциями
// - алгоритм со вспомогательной таблицей

#include <iostream>

char smol_arr[16] = {
  0, 1, 1, 2, 1, 2, 2, 3, 1, 2, 2, 3, 2, 3, 3, 4
};

char long_arr[256] = {
  0, 1, 1, 2, 1, 2, 2, 3, 1, 2, 2, 3, 2, 3, 3, 4,
  1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5,
  1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7,
  1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7,
  2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6,
  3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7,
  3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7,
  4, 5, 5, 6, 5, 6, 6, 7, 5, 6, 6, 7, 6, 7, 7, 8
};

unsigned char count_ones_by_division(unsigned long long n) {
  unsigned char count = 0;
  while (n) {
    count += n % 2;
    n /= 2;
  }
  return count;
}

unsigned char count_ones_bit_shift(unsigned long long n) {
  unsigned char w = 0;
  while (n > 0) {
    w += n & 1;
    n = n >> 1;
  }
  return w;
}

unsigned char count_ones_small_array(unsigned long long n) {
  unsigned char w = 0;
  while (n > 0) {
    w += smol_arr[n & 15];
    n = n >> 4;
  }
  return w;
}

unsigned char count_ones_long_array(unsigned long long n) {
  unsigned char w = 0;
  while (n > 0) {
    w += long_arr[n & 255];
    n = n >> 8;
  }
  return w;
}

int main() {

}